Catalogs/ПараметрыШагов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>ПараметрыШагов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПараметров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ТипыПараметров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Каталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Логин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пароль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПараметрыШагов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипПараметраПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПараметраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбранноеЗначение = ВыбратьФайлКаталог();
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		Объект.ЗначениеПараметра = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	Если Объект.ТипПараметра = Перечисления.ТипыПараметров.Файл или Объект.ТипПараметра = Перечисления.ТипыПараметров.Каталог Тогда
		Элементы.ЗначениеПараметра.КнопкаВыбора = Истина;
	Иначе
		Элементы.ЗначениеПараметра.КнопкаВыбора = Ложь;
	КонецЕсли;
КонецПроцедуры

Функция ВыбратьФайлКаталог()
	
	
	Если Объект.ТипПараметра = Перечисления.ТипыПараметров.Каталог Тогда
		РежимВыбораФайла = РежимДиалогаВыбораФайла.ВыборКаталога;
	Иначе
		РежимВыбораФайла = РежимДиалогаВыбораФайла.Сохранение;
	КонецЕсли;
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимВыбораФайла);
	ДиалогФыбораФайла.Фильтр = "(*.*)|*.*"; 
	
	Если НЕ ДиалогФыбораФайла.Выбрать() Тогда
		Возврат Неопределено;
	ИначеЕсли РежимВыбораФайла = РежимДиалогаВыбораФайла.ВыборКаталога Тогда
		Возврат ДиалогФыбораФайла.Каталог;
	Иначе
		Возврат ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;	
	
КонецФункции


#КонецОбласти
